test/jmeter/subscribeContext.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.2.1">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Broker UpdateAndSubscriptionRequest" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">1</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="SubscriptionRequest" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;description&quot;: &quot;A subscription to get info about Room1&quot;,&#xd;
  &quot;subject&quot;: {&#xd;
    &quot;entities&quot;: [&#xd;
      {&#xd;
        &quot;id&quot;: &quot;Room1&quot;,&#xd;
        &quot;type&quot;: &quot;Room&quot;,&#xd;
	   &quot;isPattern&quot;:false&#xd;
      }&#xd;
    ],&#xd;
    &quot;condition&quot;: {&#xd;
      &quot;attrs&quot;: [&#xd;
	  &quot;temp&quot;&#xd;
      ]&#xd;
    }&#xd;
  },&#xd;
  &quot;notification&quot;: {&#xd;
    &quot;http&quot;: {&#xd;
      &quot;url&quot;: &quot;http://192.168.100.162:8888&quot;&#xd;
    },&#xd;
    &quot;attrs&quot;: [&#xd;
	&quot;pressure&quot;&#xd;
    ]&#xd;
  },&#xd;
  &quot;expires&quot;: &quot;2040-01-01T14:00:00.00Z&quot;,&#xd;
  &quot;throttling&quot;: 5&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">192.168.100.120</stringProp>
          <stringProp name="HTTPSampler.port">8070</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/v2/subscriptions</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="ngsiv1UpdateRequest" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
&quot;contextElements&quot;: [&#xd;
{&#xd;
&quot;entityId&quot;: {&#xd;
&quot;id&quot;: &quot;Room1&quot;,&#xd;
&quot;type&quot;: &quot;Room&quot;,&#xd;
&quot;isPattern&quot;: false&#xd;
},&#xd;
&quot;attributes&quot;: [&#xd;
{&#xd;
&quot;name&quot;: &quot;temp&quot;,&#xd;
&quot;type&quot;: &quot;float&quot;,&#xd;
&quot;value&quot;: 54&#xd;
},&#xd;
{&#xd;
&quot;name&quot;: &quot;pressure&quot;,&#xd;
&quot;type&quot;: &quot;float&quot;,&#xd;
&quot;value&quot;: 54&#xd;
}&#xd;
],&#xd;
&quot;domainMetadata&quot;: [&#xd;
{&#xd;
&quot;name&quot;: &quot;location&quot;,&#xd;
&quot;type&quot;: &quot;point&quot;,&#xd;
&quot;value&quot;: {&#xd;
&quot;latitude&quot;: 49.406393,&#xd;
&quot;longitude&quot;: 8.684208&#xd;
}&#xd;
}&#xd;
]&#xd;
}&#xd;
],&#xd;
&quot;updateAction&quot;: &quot;UPDATE&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">192.168.100.120</stringProp>
          <stringProp name="HTTPSampler.port">8070</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/ngsi10/updateContext</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="ngsiv1DeleteRequest" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
&quot;contextElements&quot;: [&#xd;
{&#xd;
&quot;entityId&quot;: {&#xd;
&quot;id&quot;: &quot;Room1&quot;,&#xd;
&quot;type&quot;: &quot;Room&quot;,&#xd;
&quot;isPattern&quot;: false&#xd;
},&#xd;
&quot;attributes&quot;: [&#xd;
{&#xd;
&quot;name&quot;: &quot;temp&quot;,&#xd;
&quot;type&quot;: &quot;float&quot;,&#xd;
&quot;value&quot;: 54&#xd;
},&#xd;
{&#xd;
&quot;name&quot;: &quot;pressure&quot;,&#xd;
&quot;type&quot;: &quot;float&quot;,&#xd;
&quot;value&quot;: 54&#xd;
}&#xd;
],&#xd;
&quot;domainMetadata&quot;: [&#xd;
{&#xd;
&quot;name&quot;: &quot;location&quot;,&#xd;
&quot;type&quot;: &quot;point&quot;,&#xd;
&quot;value&quot;: {&#xd;
&quot;latitude&quot;: 49.406393,&#xd;
&quot;longitude&quot;: 8.684208&#xd;
}&#xd;
}&#xd;
]&#xd;
}&#xd;
],&#xd;
&quot;updateAction&quot;: &quot;DELETE&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">192.168.100.120</stringProp>
          <stringProp name="HTTPSampler.port">8070</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/ngsi10/updateContext</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="ngsiv1CreateRequest" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
&quot;contextElements&quot;: [&#xd;
{&#xd;
&quot;entityId&quot;: {&#xd;
&quot;id&quot;: &quot;Room1&quot;,&#xd;
&quot;type&quot;: &quot;Room&quot;,&#xd;
&quot;isPattern&quot;: false&#xd;
},&#xd;
&quot;attributes&quot;: [&#xd;
{&#xd;
&quot;name&quot;: &quot;temp&quot;,&#xd;
&quot;type&quot;: &quot;float&quot;,&#xd;
&quot;value&quot;: 54&#xd;
},&#xd;
{&#xd;
&quot;name&quot;: &quot;pressure&quot;,&#xd;
&quot;type&quot;: &quot;float&quot;,&#xd;
&quot;value&quot;: 54&#xd;
}&#xd;
],&#xd;
&quot;domainMetadata&quot;: [&#xd;
{&#xd;
&quot;name&quot;: &quot;location&quot;,&#xd;
&quot;type&quot;: &quot;point&quot;,&#xd;
&quot;value&quot;: {&#xd;
&quot;latitude&quot;: 49.406393,&#xd;
&quot;longitude&quot;: 8.684208&#xd;
}&#xd;
}&#xd;
]&#xd;
}&#xd;
],&#xd;
&quot;updateAction&quot;: &quot;CREATE&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">192.168.100.120</stringProp>
          <stringProp name="HTTPSampler.port">8070</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/ngsi10/updateContext</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="RespTimeGraphVisualizer" testclass="ResultCollector" testname="Response Time Graph" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>